InformationRegisters/бит_ДоступныеИнтерфейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ДоступныеИнтерфейсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступенРусский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/бит_ПолныеПрава/Ext/Module.bsl
#Область ПроцедурыИФункцииСтруктурыПодчиненности

Функция ПолучитьСписокПодчиненныхДокументов(ДокументОснование, мКэшПраваДоступаКМетаданным, ИмяКритерия = "бит_СтруктураПодчиненности") Экспорт
		
	ТекстЗапроса = "";
	
	ТаблицаДокументов 	 = Новый ТаблицаЗначений;
	ТипДокументОснование = ТипЗнч(ДокументОснование);
	СоставКритерия		 = Метаданные.КритерииОтбора[ИмяКритерия].Состав;
	
	Для Каждого ЭлементСостава ИЗ СоставКритерия Цикл
		
		Если Не ЭлементСостава.Тип.СодержитТип(ТипДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = бит_ОбщегоНазначения.РазобратьПутьКОбъектуМетаданных(ПутьКДанным
																				   ,мКэшПраваДоступаКМетаданным);
		Если Не СтруктураПутьКДанным.ЕстьДоступКМетаданным Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." 
						   + СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
			
		ИмяТЧ 		 = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
					   |ВЫБРАТЬ") + "
					   |" + СтруктураПутьКДанным.ВидОбъекта   + ".Ссылка ИЗ " + ИмяОбъекта 						+ "."
					      + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " 	  + СтруктураПутьКДанным.ВидОбъекта + "
					   |" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
					   |";
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ТаблицаДокументов = РезультатЗапроса.Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ПолучитьСписокПодчиненныхДокументов()

Функция ДействияПередСтартомСистемы() Экспорт

	РезСтр = Новый Структура("ТекстСообщения, Отказ, ЭтоИнтПоставка", "", Ложь, Ложь);
	
	Отказ = Ложь;
	ТекстСообщения = "";
	
	Если НЕ Отказ И РезСтр.ЭтоИнтПоставка Тогда
		Параметры = Новый Структура;
		Параметры.Вставить("ПервыйЗапросПараметров", Ложь);
		Параметры.Вставить("ПараметрЗапуска", ""); //ПараметрЗапуска
		Параметры.Вставить("СтрокаСоединенияИнформационнойБазы", СтрокаСоединенияИнформационнойБазы());
		
		ПарамКлиента = СтандартныеПодсистемыВызовСервера.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
		
		Если ПарамКлиента.НеобходимоОбновлениеИнформационнойБазы Тогда
			
			 ТекПользователь   = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ТекущийПользователь");
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	РезСтр.ТекстСообщения = ТекстСообщения;
	РезСтр.Отказ = Отказ;

	Возврат РезСтр;
	
КонецФункции // ДействияПередСтартомСистемы()

Функция ПользовательОпределен(ОписаниеОшибкиОпределенияПользователя) Экспорт

	ПользовательОпределен = Ложь;
	ОписаниеОшибкиОпределенияПользователя = "";
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) Тогда
		Если бит_УправлениеПользователямиСервер.ОпределитьТекущегоПользователя(ОписаниеОшибкиОпределенияПользователя) Тогда
			ПользовательОпределен = ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь);
		КонецЕсли;
	Иначе
		ПользовательОпределен = Истина;
	КонецЕсли;
	Возврат ПользовательОпределен;
	
КонецФункции // ПользовательОпределен()

Функция ДействияПриСтартеУправляемогоПриложения()  Экспорт
	
	ПараметрыКлиента = Новый Структура;
	
	// Определение/регистрация нового пользователя.
	ОписаниеОшибкиОпределенияПользователя = "";
	флПользовательОпределен = бит_ПолныеПрава.ПользовательОпределен(ОписаниеОшибкиОпределенияПользователя);
	
	ПараметрыКлиента.Вставить("ПользовательОпределен",флПользовательОпределен);
	ПараметрыКлиента.Вставить("ОписаниеОшибкиОпределенияПользователя",ОписаниеОшибкиОпределенияПользователя);
	
	// Проверка необходимости обновления информационной базы.
	Сведения =  бит_ОбщегоНазначения.ПолучитьСведенияОПрограмме();
	НомерРелизаБиТ       = Сведения.НомерРелиза_БИТ;
	КонстантаНомерРелиза = Константы.бит_НомерВерсииКонфигурацииБИТ.Получить();
	
	флПервыйЗапуск = (КонстантаНомерРелиза="");
	флНеобходимоОбновление = ?(НомерРелизаБиТ<>КонстантаНомерРелиза,Истина,Ложь);
	
	ПараметрыКлиента.Вставить("ПервыйЗапуск"        ,флПервыйЗапуск);
	ПараметрыКлиента.Вставить("НеобходимоОбновление",флНеобходимоОбновление);
	ПараметрыКлиента.Вставить("НомерРелизаБиТ"      ,НомерРелизаБиТ);
	ПараметрыКлиента.Вставить("КонстантаНомерРелиза",КонстантаНомерРелиза);
	ПараметрыКлиента.Вставить("СинонимБИТ"          ,Сведения.Синоним_БИТ);
	
	флЗапускВозможен = флПользовательОпределен И НЕ флПервыйЗапуск И НЕ флНеобходимоОбновление;
	
	Если флПользовательОпределен Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Наименование,
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
		Выборка = Запрос.Выполнить().Выбрать();
		
		КоличествоЗаписейВВыборке = Выборка.Количество();
		
		Если КоличествоЗаписейВВыборке = 1 Тогда
			
			Выборка.Следующий();
			
			бит_УправлениеПользователямиСервер.УстановитьЗначениеПоУмолчаниюТиповой("ОсновнаяОрганизация"
																					, Выборка.Ссылка
																					, ПараметрыСеанса.ТекущийПользователь);
			
		ИначеЕсли КоличествоЗаписейВВыборке = 0 Тогда
			
			Выборка.Следующий();
			
			бит_УправлениеПользователямиСервер.УстановитьЗначениеПоУмолчаниюТиповой("ОсновнаяОрганизация"
																					, Неопределено
																					, ПараметрыСеанса.ТекущийПользователь);
			
		КонецЕсли;	
		
		
		Если Не бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
			
			// Загрузить курсы валют.
			Если бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("АвтозагрузкаКурсовВалютПриНачалеРаботы") Тогда
				
				// Проверить если необходимо загрузить курсы валют.
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ МАКСИМУМ(Период) КАК МаксПериод ИЗ РегистрСведений.КурсыВалют.СрезПоследних()";
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					
				КонецЕсли;
						
			КонецЕсли;
			
		КонецЕсли;
		
		// Определим заголовок системы.
		ЗаголовокСистемы = Константы.ЗаголовокСистемы.Получить();
		
		Если Пустаястрока(ЗаголовокСистемы) Тогда
			Если ЗначениеЗаполнено(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация")) Тогда
				ЗаголовокСистемы = Строка(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация"));
			КонецЕсли;
		КонецЕсли; 
		
		ПараметрыКлиента.Вставить("ЗаголовокСистемы",ЗаголовокСистемы);
		
	КонецЕсли; 
	
	
	Возврат ПараметрыКлиента;
	
КонецФункции // ДействияПриСтартеУправляемогоПриложения()

Процедура ЗаполнитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	// Инициализация параметров сеанса системы лицензирования.
	ПараметрыСеанса.бит_сл_ОбработкаЛицензирования   = "";
	ПараметрыСеанса.бит_сл_БуферЛицензирования       = "";		
	ПараметрыСеанса.бит_сл_БуферЛицензированияВторой = "";
	
КонецПроцедуры // ЗаполнитьПараметрыСеанса()

Функция ПолучитьПараметрыДляСтартаСистемы()  Экспорт
	
	Парам           = Новый Структура;
	ТекПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Сведения = бит_ОбщегоНазначения.ПолучитьСведенияОПрограмме();
	
    // Параметры, необходимые для выполнения обновления.
	Парам.Вставить("Сведения"              , Сведения);
	Парам.Вставить("НомерРелизаБиТ"        , Сведения.НомерРелиза_БИТ);
	Парам.Вставить("КонстантаНомерРелиза"  , Константы.бит_НомерВерсииКонфигурацииБИТ.Получить()); 
	Парам.Вставить("ПервыйЗапуск"          , НЕ ЗначениеЗаполнено(Парам.КонстантаНомерРелиза)); 
	Парам.Вставить("НеобходимоОбновитьИБ"  , Парам.НомерРелизаБиТ <> Парам.КонстантаНомерРелиза);
	Парам.Вставить("ЕстьПраваДляОбновления", ПроверитьПраваДляОбновления());
	Парам.Вставить("РусскийПользователь"   , РегистрыСведений.бит_ДоступныеИнтерфейсы.ОпределитьДоступностьРусскогоИнтерфейса(ТекПользователь));	
	
	// Вид продукта.
	Парам.Вставить("ЭтоСемействоУПП", бит_ОбщегоНазначения.ЭтоСемействоУПП());
	Парам.Вставить("ЭтоСемействоБП", бит_общегоНазначения.ЭтоСемействоБП());
	
	// Запустить процедуру бит_ОбщегоНазначения.ДействияПриНачалеРаботыСистемы() безусловно от необходимости обновления.
	Парам.Вставить("ВыполнитьДопДействия"  , Ложь);
	
	// Необходимость открытия форм при стратре.
	
    // Обработки.бит_ДополнительнаяИнформация.	
	флОткрыть = (бит_УправлениеПользователямиСервер.ПолучитьНастройкуПользователя("ПоказыватьДополнительнуюИнформациюБит", ТекПользователь) 
	             ИЛИ Парам.НеобходимоОбновитьИБ) И Парам.РусскийПользователь;
				 
	Парам.Вставить("ОткрытьДополнительнуюИнформациюБИТ", флОткрыть); 
	
	флОткрыть = Ложь; 		
								  
	Парам.Вставить("ОткрытьПанельФункцийБИТ", флОткрыть); 							  
	
	// Открытие обработки конвертации.
	флОткрыть = ?( Лев(Парам.КонстантаНомерРелиза, 1) = "2", Истина, Ложь) 
	            ИЛИ ?(Лев(Парам.КонстантаНомерРелиза, 6)= "3.0.1." , Истина, Ложь);
	Парам.Вставить("ОткрытьКонвертациюОборотов", флОткрыть);
	
	Возврат Парам;
	
КонецФункции // ПолучитьПараметрыДляСтартаСистемы()

Функция ПроверитьПраваДляОбновления()
	
	// Проверка наличия прав для обновления информационной базы.
	флЕстьПрава = Истина;
	Если НЕ ПравоДоступа("МонопольныйРежим" , Метаданные) 
		ИЛИ НЕ ПравоДоступа("Изменение"        , Метаданные.Константы.бит_НомерРелиза) 	
		ИЛИ НЕ ПравоДоступа("Изменение"        , Метаданные.Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы) 			 
		ИЛИ НЕ ПравоДоступа("Использование"    , Метаданные.Обработки.бит_ОбновлениеИнформационнойБазы) 
		ИЛИ НЕ ПравоДоступа("Изменение"        , Метаданные.Справочники.бит_ОбъектыСистемы)
		ИЛИ НЕ ПравоДоступа("Администрирование", Метаданные) Тогда
		
		флЕстьПрава = Ложь;
		
	КонецЕсли;
	
	Возврат флЕстьПрава;
	
КонецФункции // ПроверитьПраваДляОбновления()

Функция ПолучитьКодЯзыка() Экспорт

	КодЯзыка = "ru";
	
	ТекЯзык = ТекущийЯзык();
	
	Если ТипЗнч(ТекЯзык) = Тип("ОбъектМетаданных") Тогда
		
		КодЯзыка = ТекЯзык.КодЯзыка;
	
	Иначе	
		
		КодЯзыка = ТекЯзык;
		
	КонецЕсли; 
	
	Возврат КодЯзыка;
	
КонецФункции // ПолучитьКодЯзыка()

// Сохранение в параметре сеанса ГраницыЗапретаИзмененияДанных границ запрета изменений данных.
Процедура УстановитьПараметрГраницыЗапретаИзмененияДанных() Экспорт
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Если РольДоступна("ПолныеПрава")  Тогда

		ПараметрыСеанса.бит_ГраницыЗапретаИзмененияДанных = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(0));
		Возврат;
	КонецЕсли;
	ТекстЗапросаПоПриоритетамЗаписей = "ВЫБРАТЬ
	                                   |	Границы.Организация КАК Организация,
	                                   |	Границы.Пользователь КАК Пользователь,
	                                   |	ВЫБОР
	                                   |		КОГДА Границы.Пользователь = НЕОПРЕДЕЛЕНО
	                                   |			ТОГДА 3
	                                   |		КОГДА Границы.Пользователь ССЫЛКА Справочник.ГруппыПользователей
	                                   |				И ГруппыПользователей.Пользователь = &Пользователь
	                                   |			ТОГДА 2
	                                   |		КОГДА Границы.Пользователь ССЫЛКА Справочник.Пользователи
	                                   |				И Границы.Пользователь = &Пользователь
	                                   |			ТОГДА 1
	                                   |	КОНЕЦ КАК Приоритет,
	                                   |	Границы.ГраницаЗапретаИзменений КАК ГраницаЗапретаИзменений
	                                   |ИЗ
	                                   |	РегистрСведений.бит_ГраницыЗапретаИзмененияДанных КАК Границы
	                                   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователей
	                                   |		ПО (ГруппыПользователей.Пользователь = &Пользователь)
	                                   |			И (ГруппыПользователей.Ссылка = Границы.Пользователь)";
                                       
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
                   |    Организации.Ссылка КАК Организация,
                   |    МИНИМУМ(ЕСТЬNULL(ТаблицаГраницыЗапрета.ГраницаЗапретаИзменений, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59))) КАК ГраницаЗапретаИзменений
                   |ИЗ
                   |    Справочник.Организации КАК Организации
                   |        ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |            Границы.Организация КАК Организация,
                   |            МИНИМУМ(Приоритеты.Приоритет) КАК Приоритет
                   |        ИЗ
                   |            РегистрСведений.ГраницыЗапретаИзмененияДанных КАК Границы
                   |                ЛЕВОЕ СОЕДИНЕНИЕ (" + ТекстЗапросаПоПриоритетамЗаписей + ") КАК Приоритеты
                   |                ПО Границы.Организация = Приоритеты.Организация
                   |                    И Границы.Пользователь = Приоритеты.Пользователь
                   |        
                   |        СГРУППИРОВАТЬ ПО
                   |            Границы.Организация) КАК ТаблицаПриоритетов
                   |        ПО ТаблицаПриоритетов.Организация = Организации.Ссылка
                   |        ЛЕВОЕ СОЕДИНЕНИЕ (" + ТекстЗапросаПоПриоритетамЗаписей + ") КАК ТаблицаГраницыЗапрета
                   |        ПО ТаблицаПриоритетов.Организация = ТаблицаГраницыЗапрета.Организация
                   |            И ТаблицаПриоритетов.Приоритет = ТаблицаГраницыЗапрета.Приоритет
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    Организации.Ссылка";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
    
    РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Соответствие = Неопределено;
	Иначе			
		Соответствие = Новый Соответствие;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Соответствие[Выборка.Организация] = Выборка.ГраницаЗапретаИзменений;
		КонецЦикла;
		ЕСли Соответствие.Количество() = 0 Тогда
			Соответствие = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Соответствие <> Неопределено Тогда
		Соответствие.Вставить(Справочники.Организации.ПустаяСсылка(), Дата('00010101'));
		СохранятьСоответствие = Ложь;
		Для Каждого КлючИЗначение Из Соответствие Цикл
			ЕСли КлючИЗначение.Значение <> Дата('00010101') Тогда
				СохранятьСоответствие = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ СохранятьСоответствие Тогда
			Соответствие = Неопределено;
		КонецЕсли;			
	КонецЕсли;
		
	ПараметрыСеанса.бит_ГраницыЗапретаИзмененияДанных = Новый ХранилищеЗначения(Соответствие, Новый СжатиеДанных(0));	
	
КонецПроцедуры
// БИТ_ЖКХ добавление кода конец : 12.01.2011

#КонецОбласти
